src/config/Documents/ЗакрытиеЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗаказовПоставщикам</Name>
			<Comment>(Упр) Закрытие заказов поставщикам без исполнения</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовПокупателей</xr:Item>
				<xr:Item>InformationRegister.ПричиныЗакрытияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикамСезонные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытияЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/РазмещениеЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РазмещениеЗаказовПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТоварТара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТоварТара</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/РасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНеавтоматизированнойТорговойТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоПрессФормам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетыВозврат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РасчетыВозврат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/ВидыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоЗапчасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аксессуары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрышкиНаклейки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РекламнаяПродукция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/ЗакрытиеЗаказовПоставщикам/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Добавляет в табличную часть Заказы строки с заказами поставщикам, по которым существуют
// остатки в регистре ЗаказыПоставщикам.
//
// Параметры:
//  Нет.
//
Процедура ЗаполнитьЗаказыПоОстаткам(поМинусам=ложь) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|ГДЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику ССЫЛКА Документ.ЗаказПоставщику И ЕСТЬNULL(Подразделение.ВЭД, ЛОЖЬ) = ЛОЖЬ";
Если поМинусам тогда
	Запрос.Текст = Запрос.Текст +"
	|И ЗаказыПоставщикамОстатки.КоличествоОстаток < 0";
КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Заказы.Добавить();
		НоваяСтрока.ЗаказПоставщику = Выборка.ЗаказПоставщику;
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьЗаказыПоОстаткам()

Процедура ЗаполнитьЗаказыПоКоторымБылоПоступление () Экспорт
 Запрос =Новый Запрос;
 Запрос.Текст ="ВЫБРАТЬ 
|  ЗаказПоставщику,
|	  СУММА(КоличествоОстаток) КоличествоОстаток
|	  ПОМЕСТИТЬ ВТ_ЗаказыПоставщику
|	   ИЗ
| (
| 	ВЫБРАТЬ 
| 		ЗаказПоставщику КАК ЗаказПоставщику,
|		Номенклатура ,
|	ВЫБОР КОГДА КоличествоОстаток>0 ТОГДА КоличествоОстаток ИНАЧЕ -КоличествоОстаток КОНЕЦ КоличествоОстаток
|	ИЗ
|		РегистрНакопления.ЗаказыПоставщикам.Остатки( , (ЗаказПоставщику.НомерКонтейнера<>"""" И ЕСТЬNULL(Подразделение.ВЭД, ЛОЖЬ) = ЛОЖЬ ) И Номенклатура.ВидТовара = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски))
|	ГДЕ КоличествоОстаток <> 0  ) А  
|	СГРУППИРОВАТЬ ПО ЗаказПоставщику //)  КАК ЗаказыПоставщикамОстатки
|	
|;	
|ВЫБРАТЬ РАЗЛИЧНЫЕ Сделка  ЗаказПоставщику
|ИЗ Документ.ПоступлениеТоваровУслуг ГДЕ Ссылка.Проведен И Сделка В (ВЫБРАТЬ ЗаказПоставщику ИЗ ВТ_ЗаказыПоставщику)";

Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Заказы.Добавить();
		НоваяСтрока.ЗаказПоставщику = Выборка.ЗаказПоставщику;
	КонецЦикла; 

КонецПроцедуры	

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  ВыборкаПоШапкеДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуПоЗаказамПоставщиков()
	
	СписокЗаказов = Заказы.ВыгрузитьКолонку("ЗаказПоставщику");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",            Ссылка);
	Запрос.УстановитьПараметр("МоментДокумента",           МоментВремени());
	Запрос.УстановитьПараметр("СписокЗаказов",             СписокЗаказов);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПоставщикамОстатки.ДоговорКонтрагента,
	               |	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	               |	ЗаказыПоставщикамОстатки.Номенклатура,
	               |	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	               |	ЗаказыПоставщикамОстатки.СтатусПартии,
	               |	ЗаказыПоставщикамОстатки.Цена,
	               |	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения,
	               |	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
	               |	ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	               |	ЗаказыПоставщикамОстатки.СуммаУпрОстаток КАК СуммаУпр,
	               |	ЗаказыПоставщикамОстатки.ВЭД,
	               |	ЗаказыПоставщикамОстатки.Подразделение
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(&МоментДокумента, ЗаказПоставщику В (&СписокЗаказов)) КАК ЗаказыПоставщикамОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказыПоставщикамОстатки.ДоговорКонтрагента,
	               |	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	               |	ЗаказыПоставщикамОстатки.Номенклатура,
	               |	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	               |	ЗаказыПоставщикамОстатки.СтатусПартии,
	               |	ЗаказыПоставщикамОстатки.Цена,
	               |	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
    //***было до 02.2016 нифига не работало, т.к. отбор по договорам неправильно делать. Заказывают по одному, поступление - по другому.
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	ТаблицаЗаказов.ПричинаЗакрытияЗаказа,
	//|	ЗаказыПоставщикамОстатки.ДоговорКонтрагента,
	//|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	//|	ЗаказыПоставщикамОстатки.Номенклатура,
	//|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	//|	ЗаказыПоставщикамОстатки.СтатусПартии,
	//|	ЗаказыПоставщикамОстатки.Цена,
	//|	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения,
	//|	ЗаказыПоставщикамОстатки.КоличествоОстаток          КАК Количество,
	//|	ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	//|	ЗаказыПоставщикамОстатки.СуммаУпрОстаток            КАК СуммаУпр
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&МоментДокумента, ДоговорКонтрагента В (ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ.ДоговорКонтрагента
	//|                                                                 ИЗ Документ.ЗаказПоставщику КАК Заказ
	//|                                                                 ГДЕ Заказ.Ссылка В (&СписокЗаказов))
	//|                                                               И ЗаказПоставщику В (&СписокЗаказов)) КАК ЗаказыПоставщикамОстатки
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	Документ.ЗакрытиеЗаказовПоставщикам.Заказы КАК ТаблицаЗаказов
	//|ПО
	//|	ТаблицаЗаказов.Ссылка = &ДокументСсылка
	//|	И
	//|	ТаблицаЗаказов.ЗаказПоставщику = ЗаказыПоставщикамОстатки.ЗаказПоставщику
	//|";
	
КонецФункции // ПодготовитьТаблицуТоваров()

Функция ПодготовитьТаблицуПричинЗакрытияЗаказов()
	
	СписокЗаказов = Заказы.ВыгрузитьКолонку("ЗаказПоставщику");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",            Ссылка);
	Запрос.УстановитьПараметр("МоментДокумента",           МоментВремени());
	Запрос.УстановитьПараметр("СписокЗаказов",             СписокЗаказов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаЗаказов.ПричинаЗакрытияЗаказа,
	               |	ЗаказыПоставщикамОстатки.ДоговорКонтрагента,
	               |	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	               |	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
	               |	ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	               |	ЗаказыПоставщикамОстатки.СуммаУпрОстаток КАК СуммаУпр
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(&МоментДокумента, ЗаказПоставщику В (&СписокЗаказов)) КАК ЗаказыПоставщикамОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказовПоставщикам.Заказы КАК ТаблицаЗаказов
	               |		ПО (ТаблицаЗаказов.ЗаказПоставщику = ЗаказыПоставщикамОстатки.ЗаказПоставщику)
	               |ГДЕ
	               |	ТаблицаЗаказов.Ссылка = &ДокументСсылка";
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  ВыборкаПоШапкеДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуПоРазмещениюЗаказовПокупателей()

	СписокЗаказов = Заказы.ВыгрузитьКолонку("ЗаказПоставщику");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",            Ссылка);
	Запрос.УстановитьПараметр("МоментДокумента",           МоментВремени());
	Запрос.УстановитьПараметр("СписокЗаказов",             СписокЗаказов);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|    ЗаказПоставщику,
	|    Номенклатура,
	|    ХарактеристикаНоменклатуры,
	|    ТоварТара,
	|    ЗаказПокупателя,
	|    КоличествоОстаток          КАК Количество
	|ИЗ
	|    РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&МоментДокумента, ЗаказПоставщику В (&СписокЗаказов))";
	
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗаказов;

КонецФункции // ПодготовитьТаблицуТоваров()

// По итогам региситра "Расчеты с контрагентами" подготавливает таблицу для формирования движений по этому регистру
Функция ПодготовитьТаблицуПоРасчетамУпр()

	СписокЗаказов = Заказы.ВыгрузитьКолонку("ЗаказПоставщику");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментДокумента",           МоментВремени());
	Запрос.УстановитьПараметр("СписокЗаказов",             СписокЗаказов);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|    ДоговорКонтрагента,
	|    Сделка,
	|    РасчетыВозврат,
	|    СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|    СуммаУпрОстаток            КАК СуммаУпр
	|ИЗ
	|    РегистрНакопления.РасчетыСКонтрагентами.Остатки(&МоментДокумента, Сделка В (&СписокЗаказов))";
	
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗаказов;

КонецФункции // ПодготовитьТаблицуТоваров()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиЗаказы(ТаблицаПоТоварам, ВыборкаПоШапкеДокумента, 
	                                              Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ЗаказПоставщику");

	// Теперь позовем общую процедуру проверки.
	ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Заказы", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиЗаказы()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  ВыборкаПоШапкеДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ВыборкаПоШапкеДокумента, ТаблицаПоЗаказамПоставщикам, ТаблицаПоРазмещениюЗаказовПокупателей, 
								ТаблицаПоРасчетам, Отказ, Заголовок);

	Если ТаблицаПоЗаказамПоставщикам.Количество() > 0 Тогда

		НаборДвижений = Движения.ЗаказыПоставщикам;

		ТаблицаДвижений = НаборДвижений.Выгрузить();

		ЗагрузитьВТаблицуЗначений(ТаблицаПоЗаказамПоставщикам, ТаблицаДвижений);

		НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Движения.ЗаказыПоставщикам.ВыполнитьРасход();

		//***2016.02.18 заремлено, т.к. невозможно было закрыть дважды один и тот же заказ
		//ТаблицаДляПроведенияПричин = ПодготовитьТаблицуПричинЗакрытияЗаказов();
		//ТаблицаДляПроведенияПричин.Свернуть("ЗаказПоставщику, ПричинаЗакрытияЗаказа", "СуммаВзаиморасчетов, СуммаУпр");
		//НаборДвижений = Движения.ПричиныЗакрытияЗаказов;
		//Для каждого СтрокаТаблицы Из ТаблицаДляПроведенияПричин Цикл
		//	Если НЕ ЗначениеНеЗаполнено(СтрокаТаблицы.ПричинаЗакрытияЗаказа) Тогда
		//		НоваяЗапись = НаборДвижений.Добавить();
		//		НоваяЗапись.Заказ                 = СтрокаТаблицы.ЗаказПоставщику;
		//		НоваяЗапись.ПричинаЗакрытияЗаказа = СтрокаТаблицы.ПричинаЗакрытияЗаказа;
		//		НоваяЗапись.СуммаВзаиморасчетов   = СтрокаТаблицы.СуммаВзаиморасчетов;
		//		НоваяЗапись.СуммаУпрУчета         = СтрокаТаблицы.СуммаУпр;
		//	КонецЕсли; 
		//КонецЦикла;
		//***

		Если ТаблицаПоРасчетам.Количество() > 0 Тогда

			НаборДвижений = Движения.РасчетыСКонтрагентами;

			ТаблицаДвижений = НаборДвижений.Выгрузить();
			
			ЗагрузитьВТаблицуЗначений(ТаблицаПоРасчетам, ТаблицаДвижений);
			
			НаборДвижений.мПериод = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
			Движения.РасчетыСКонтрагентами.ВыполнитьРасход();

		КонецЕсли;

	КонецЕсли;

	Если ТаблицаПоРазмещениюЗаказовПокупателей.Количество() > 0 Тогда

		НаборДвижений = Движения.РазмещениеЗаказовПокупателей;

		ТаблицаДвижений = НаборДвижений.Выгрузить();

		ЗагрузитьВТаблицуЗначений(ТаблицаПоРазмещениюЗаказовПокупателей, ТаблицаДвижений);

		НаборДвижений.мПериод = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Движения.РазмещениеЗаказовПокупателей.ВыполнитьРасход();

	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);

	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = СформироватьДеревоПолейЗапросаПоШапке();
	ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",        "ВестиПартионныйУчетПоСкладам", "ВестиПартионныйУчетПоСкладам");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// Подготовим таблицу 
	ТаблицаПоЗаказамПоставщикам = ПодготовитьТаблицуПоЗаказамПоставщиков();
	
	// Подготовим таблицу 
	ТаблицаПоРазмещениюЗаказовПокупателей = ПодготовитьТаблицуПоРазмещениюЗаказовПокупателей();
	
	ТаблицаПоРасчетам = ПодготовитьТаблицуПоРасчетамУпр();
	
	// Проверить заполнение ТЧ "Товары".
	ПроверитьЗаполнениеТабличнойЧастиЗаказы(ТаблицаПоЗаказамПоставщикам, СтруктураШапкиДокумента, 
											Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда

		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоЗаказамПоставщикам, ТаблицаПоРазмещениюЗаказовПокупателей,
							ТаблицаПоРасчетам, Отказ, Заголовок);
							
	КонецЕсли; 

КонецПроцедуры	// ОбработкаПроведения()

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
